Repository: abfuad/sp
Catalog: translations/messages+intl-icu.*.xlf
Languages: or

source: User Group
or: Garee Fayyadamaa

source: Edit
or: Gulaali

source: Add New
or: Haaraa Dabaluu

source: User Group List
or: Tarree Garee Fayyadamaa

source: Description
or: Ibsa

source: Action
or: Gocha

source: Logout
or: Bahi

source: Login
or: seeni

source: School Budget Details
or: Ibsa Baajata

source: School Budget
or: Baajata Mana Barnoota

source: back
or: Deebii

source: New Special Fee
or: Kaffaltii Addaa Haaraa

source: Special Fee
or: Kaffaltii Adabbii

source: New
or: Haaraa Dabaluu

source: Special Fee Information
or: Odeeffannoo Kaffaltii Addaa

source: back to list
or: Deebii

source: Edit Special Fee
or: Kaffaltii Addaa Gulaali

source: Special Fee
or: Kaffaltii Addaa

source: New Penality Fee
or: Kaffaltii Adabbii Haaraa

source: Penality Fee
or: Kaffaltii Adabbii

source: Penality Fee Information
or: Odeeffannoo Kaffaltii Adabbii

source: Edit Penality Fee
or: Kaffaltii Adabbii Gulaali

source: Student Payment
or: Kaffaltii Barataa

source: Start payment
or: Kaffaltii Jalqabii

source: Special Income
or: Galii Addaa

source: New Income
or: Galii Haaraa

source: Income List
or: Tarree Galii

source: User Management
or: Oggansa Fayyadamaa

source: New User
or: Fayyadamaa Haaraa

source: User List
or: Tarree Fayyadamaa

# Budget &amp; Plan
source: Budget & Plan
or: Baajata & Karoora

source: Budget List
or: Tarree Baajata

source: Income Plan
or: Karoora Galii

source: Expense Plan
or: Karoora Baasii

source: New Fee
or: Kaffaltii Haaraa

source: Fee List
or: Tarree Kaffaltii

source: System Setting
or: Haala Mijjeessuu

source: School
or: Mana Barnoota

source: Fiscal Year
or: Bara Baajataa

source: Grade
or: Kutaa

# Fee &amp; Exp Setting
source: Fee & Exp Setting
or: Galii & Basii Mijjeessuu

source: Fee Group
or: Garee Kaffaltii

source: Expense Type
or: Gosa Baasii

source: Fee Setting
or: Kaffaltii Mijjeessuu

source: Credit
or: Liqaa

source: Credit List
or: Tarree Liqaa

source: Student
or: Barataa

source: New Student
or: Barataa Haaraa

source: Student List
or: Tarree Barataa

source: Promote Student
or: Barataa Dabarsuu

source: Student Fee
or: Kaffaltii Barataa

source: New Registration
or: Galmee Haaraa

source: Student Registration
or: Galmee Barataa

source: Edit Student
or: Barataa Gulaali

source: Start Student Registration
or: Galmee Barataa Jalqa

source: User
or: Fayyadamaa

source: User Information
or: Odeeffannoo Fayyadamaa

source: Full Name
or: Maqaa Guutuu

source: Phone
or: Bilbilaa

source: Salary
or: Mindaa

source: Status
or: Haala

source: Student Information
or: Odeeffannoo Barataa

source: New Payment
or: Kaffaltii Haaraa

source: Payment
or: Kaffaltii

source: Payment Information
or: Odeeffannoo Kaffaltii

source: description
or: Ibsa

source: New Income Plan
or: Karoora Galii Haaraa

source: Code
or: Codii

source: Source
or: Madda

source: status
or: Haala

source: Sex
or: Saala

source: Age
or: Umrii

source: EntranceYear
or: Baraa Seensaa

source: actions
or: Gocha

source: Name
or: Maqaa

source: Fee Type
or: Gosaa Kaffaltii

source: Amount
or: Hangaa

source: Reason
or: Sababaa

source: Date
or: Guyyaa

source: Cashier
or: Kan Galmesse

source: Title
or: Mataa Duree

source: CreatedBy
or: Kan Galmesse

source: CreatedAt
or: Guyyaa

source: isPaid
or: Kaffalee

source: Pay
or: Kaffalii

source: Year
or: Baraa

source: budget
or: Baajata

source: Income
or: Galii

source: Expense
or: Baasii

source: FullName
or: Maqaa Gutuu

source: isFree
or: Bilisaa

source: FeeType
or: Gosaa Kaffaltii
